# В летний лагерь нужно отвести n детей и m вожатых с помощью автобусов. Максимальная вместимость каждого автобуса 20 человек.
# Допишите программу для вычисления минимального числа автобусов,
# необходимых для перевозки детей вместе с вожатыми. Результат выведите в консоль в виде целого числа.

# import math
# n = 40
# m = 5
# bus = 20
# peoples = n + m
# x = peoples / bus
# y = math.ceil(x)
# print(y)


# n, m = map(int, input().split())
# bus = 20
# print(math.ceil(((n + m) / bus)))